Autodesk.Revit.DB.Visual.Noise.TextureRealWorldOffsetZ
The property labeled "Offset Z" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.TextureRealWorldOffsetY
The property labeled "Offset Y" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.TextureRealWorldOffsetX
The property labeled "Offset X" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.TextureLinkTextureTransforms
The property labeled "Link Transforms" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.TextureAngle
The property labeled "Angle" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray3d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.NoisePhase
The property labeled "Phase" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.NoiseLevels
The property labeled "Levels" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "1, 10".
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.NoiseSize
The property labeled "Size" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0.001, 10000000000".
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.NoiseThresholdLow
The property labeled "Low" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.NoiseThresholdHigh
The property labeled "High" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.NoiseColor2
The property labeled "Color 2" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.NoiseColor1
The property labeled "Color 1" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise.NoiseType
The property labeled "Noise Type" from the "Noise" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "NoiseType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Noise
Represents the properties of materials.
Since:
2018.1